MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M453LG6AE/mcu.h
#define ACMP_CTL_ACMPEN_Pos              (0)                                               /*!< ACMP_T::CTL: ACMPEN Position             */
#define ACMP_CTL_ACMPEN_Msk              (0x1ul << ACMP_CTL_ACMPEN_Pos)                    /*!< ACMP_T::CTL: ACMPEN Mask                 */

#define ACMP_CTL_ACMPIE_Pos              (1)                                               /*!< ACMP_T::CTL: ACMPIE Position             */
#define ACMP_CTL_ACMPIE_Msk              (0x1ul << ACMP_CTL_ACMPIE_Pos)                    /*!< ACMP_T::CTL: ACMPIE Mask                 */

#define ACMP_CTL_HYSEN_Pos               (2)                                               /*!< ACMP_T::CTL: HYSEN Position              */
#define ACMP_CTL_HYSEN_Msk               (0x1ul << ACMP_CTL_HYSEN_Pos)                     /*!< ACMP_T::CTL: HYSEN Mask                  */

#define ACMP_CTL_ACMPOINV_Pos            (3)                                               /*!< ACMP_T::CTL: ACMPOINV Position           */
#define ACMP_CTL_ACMPOINV_Msk            (0x1ul << ACMP_CTL_ACMPOINV_Pos)                  /*!< ACMP_T::CTL: ACMPOINV Mask               */

#define ACMP_CTL_NEGSEL_Pos              (4)                                               /*!< ACMP_T::CTL: NEGSEL Position             */
#define ACMP_CTL_NEGSEL_Msk              (0x3ul << ACMP_CTL_NEGSEL_Pos)                    /*!< ACMP_T::CTL: NEGSEL Mask                 */

#define ACMP_CTL_POSSEL_Pos              (6)                                               /*!< ACMP_T::CTL: POSSEL Position             */
#define ACMP_CTL_POSSEL_Msk              (0x3ul << ACMP_CTL_POSSEL_Pos)                    /*!< ACMP_T::CTL: POSSEL Mask                 */

#define ACMP_CTL_INTPOL_Pos              (8)                                               /*!< ACMP_T::CTL: INTPOL Position             */
#define ACMP_CTL_INTPOL_Msk              (0x3ul << ACMP_CTL_INTPOL_Pos)                    /*!< ACMP_T::CTL: INTPOL Mask                 */

#define ACMP_CTL_OUTSEL_Pos              (12)                                              /*!< ACMP_T::CTL: OUTSEL Position             */
#define ACMP_CTL_OUTSEL_Msk              (0x1ul << ACMP_CTL_OUTSEL_Pos)                    /*!< ACMP_T::CTL: OUTSEL Mask                 */

#define ACMP_CTL_FILTSEL_Pos             (13)                                              /*!< ACMP_T::CTL: FILTSEL Position            */
#define ACMP_CTL_FILTSEL_Msk             (0x7ul << ACMP_CTL_FILTSEL_Pos)                   /*!< ACMP_T::CTL: FILTSEL Mask                */

#define ACMP_CTL_WKEN_Pos                (16)                                              /*!< ACMP_T::CTL: WKEN Position               */
#define ACMP_CTL_WKEN_Msk                (0x1ul << ACMP_CTL_WKEN_Pos)                      /*!< ACMP_T::CTL: WKEN Mask                   */

#define ACMP_STATUS_ACMPIF0_Pos          (0)                                               /*!< ACMP_T::STATUS: ACMPIF0 Position         */
#define ACMP_STATUS_ACMPIF0_Msk          (0x1ul << ACMP_STATUS_ACMPIF0_Pos)                /*!< ACMP_T::STATUS: ACMPIF0 Mask             */

#define ACMP_STATUS_ACMPIF1_Pos          (1)                                               /*!< ACMP_T::STATUS: ACMPIF1 Position         */
#define ACMP_STATUS_ACMPIF1_Msk          (0x1ul << ACMP_STATUS_ACMPIF1_Pos)                /*!< ACMP_T::STATUS: ACMPIF1 Mask             */

#define ACMP_STATUS_ACMPO0_Pos           (4)                                               /*!< ACMP_T::STATUS: ACMPO0 Position          */
#define ACMP_STATUS_ACMPO0_Msk           (0x1ul << ACMP_STATUS_ACMPO0_Pos)                 /*!< ACMP_T::STATUS: ACMPO0 Mask              */

#define ACMP_STATUS_ACMPO1_Pos           (5)                                               /*!< ACMP_T::STATUS: ACMPO1 Position          */
#define ACMP_STATUS_ACMPO1_Msk           (0x1ul << ACMP_STATUS_ACMPO1_Pos)                 /*!< ACMP_T::STATUS: ACMPO1 Mask              */

#define ACMP_STATUS_WKIF0_Pos            (8)                                               /*!< ACMP_T::STATUS: WKIF0 Position           */
#define ACMP_STATUS_WKIF0_Msk            (0x1ul << ACMP_STATUS_WKIF0_Pos)                  /*!< ACMP_T::STATUS: WKIF0 Mask               */

#define ACMP_STATUS_WKIF1_Pos            (9)                                               /*!< ACMP_T::STATUS: WKIF1 Position           */
#define ACMP_STATUS_WKIF1_Msk            (0x1ul << ACMP_STATUS_WKIF1_Pos)                  /*!< ACMP_T::STATUS: WKIF1 Mask               */

#define ACMP_VREF_CRVCTL_Pos             (0)                                               /*!< ACMP_T::VREF: CRVCTL Position            */
#define ACMP_VREF_CRVCTL_Msk             (0xful << ACMP_VREF_CRVCTL_Pos)                   /*!< ACMP_T::VREF: CRVCTL Mask                */

#define ACMP_VREF_CRVSSEL_Pos            (6)                                               /*!< ACMP_T::VREF: CRVSSEL Position           */
#define ACMP_VREF_CRVSSEL_Msk            (0x1ul << ACMP_VREF_CRVSSEL_Pos)                  /*!< ACMP_T::VREF: CRVSSEL Mask               */

/**@}*/ /* ACMP_CONST */
/**@}*/ /* end of ACMP register group */


/*---------------------- Enhanced Analog to Digital Converter -------------------------*/
/**
    @addtogroup Enhanced Analog to Digital Converter(EADC)
    Memory Mapped Structure for EADC Controller
@{ */


typedef struct
{


/**
 * @var EADC_T::DAT
 * Offset: 0x00-0x48  A/D Data Register n for Sample Module n, n=0~18
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |RESULT    |A/D Conversion Result
 * |        |          |This field contains 12 bits conversion result.
 * |        |          |When DMOF (EADC_CTL[9]) is set to 0, 12-bit ADC conversion result with unsigned format will be filled in RESULT[11:0] and zero will be filled in RESULT[15:12].
 * |        |          |When DMOF (EADC_CTL[9]) set to 1, 12-bit ADC conversion result with 2'complement format will be filled in RESULT[11:0] and signed bits to will be filled in RESULT[15:12].
 * |[16]    |OV        |Overrun Flag
 * |        |          |If converted data in RESULT[11:0] has not been read before new conversion result is loaded to this register, OV is set to 1.
 * |        |          |0 = Data in RESULT[11:0] is recent conversion result.
 * |        |          |1 = Data in RESULT[11:0] is overwrite.
 * |        |          |Note: It is cleared by hardware after EADC_DAT register is read.
 * |[17]    |VALID     |Valid Flag
 * |        |          |This bit is set to 1 when corresponding sample module channel analog input conversion is completed and cleared by hardware after EADC_DAT register is read.
 * |        |          |0 = Data in RESULT[11:0] bits is not valid.
 * |        |          |1 = Data in RESULT[11:0] bits is valid.
 * @var EADC_T::CURDAT
 * Offset: 0x4C  EADC PDMA Current Transfer Data Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[17:0]  |CURDAT    |ADC PDMA Current Transfer Data Register
 * |        |          |This register is a shadow register of EADC_DATn (n=0~18) for PDMA support.
 * |        |          |This is a read only register.
 * @var EADC_T::CTL
 * Offset: 0x50  A/D Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ADCEN     |A/D Converter Enable Bit
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |        |          |Note: Before starting A/D conversion function, this bit should be set to 1.
 * |        |          |Clear it to 0 to disable A/D converter analog circuit power consumption.
 * |[1]     |ADCRST    |ADC A/D Converter Control Circuits Reset
 * |        |          |0 = No effect.
 * |        |          |1 = Cause ADC control circuits reset to initial state, but not change the ADC registers value.
 * |        |          |Note: ADCRST bit remains 1 during ADC reset, when ADC reset end, the ADCRST bit is automatically cleared to 0.
 * |[2]     |ADCIEN0   |Specific Sample Module A/D ADINT0 Interrupt Enable Bit
 * |        |          |The A/D converter generates a conversion end ADIF0 (EADC_STATUS2[0]) upon the end of specific sample module A/D conversion.
 * |        |          |If ADCIEN0 bit is set then conversion end interrupt request ADINT0 is generated.
 * |        |          |0 = Specific sample module A/D ADINT0 interrupt function Disabled.
 * |        |          |1 = Specific sample module A/D ADINT0 interrupt function Enabled.
 * |[3]     |ADCIEN1   |Specific Sample Module A/D ADINT1 Interrupt Enable Bit
 * |        |          |The A/D converter generates a conversion end ADIF1 (EADC_STATUS2[1]) upon the end of specific sample module A/D conversion.
 * |        |          |If ADCIEN1 bit is set then conversion end interrupt request ADINT1 is generated.
 * |        |          |0 = Specific sample module A/D ADINT1 interrupt function Disabled.
 * |        |          |1 = Specific sample module A/D ADINT1 interrupt function Enabled.
 * |[4]     |ADCIEN2   |Specific Sample Module A/D ADINT2 Interrupt Enable Bit
 * |        |          |The A/D converter generates a conversion end ADIF2 (EADC_STATUS2[2]) upon the end of specific sample module A/D conversion.
 * |        |          |If ADCIEN2 bit is set then conversion end interrupt request ADINT2 is generated.
 * |        |          |0 = Specific sample module A/D ADINT2 interrupt function Disabled.
 * |        |          |1 = Specific sample module A/D ADINT2 interrupt function Enabled.
 * |[5]     |ADCIEN3   |Specific Sample Module A/D ADINT3 Interrupt Enable Bit
 * |        |          |The A/D converter generates a conversion end ADIF3 (EADC_STATUS2[3]) upon the end of specific sample module A/D conversion.
 * |        |          |If ADCIEN3 bit is set then conversion end interrupt request ADINT3 is generated.
 * |        |          |0 = Specific sample module A/D ADINT3 interrupt function Disabled.
 * |        |          |1 = Specific sample module A/D ADINT3 interrupt function Enabled.
 * |[8]     |DIFFEN    |Differential Analog Input Mode Enable Bit
 * |        |          |0 = Single-end analog input mode.
 * |        |          |1 = Differential analog input mode.
 * |[9]     |DMOF      |ADC Differential Input Mode Output Format
 * |        |          |0 = A/D conversion result will be filled in RESULT (EADC_DATn[15:0] , n= 0 ~18) with unsigned format.
 * |        |          |1 = A/D conversion result will be filled in RESULT (EADC_DATn[15:0] , n= 0 ~18) with 2'complement format.
 * |[11]    |PDMAEN    |PDMA Transfer Enable Bit
 * |        |          |When A/D conversion is completed, the converted data is loaded into EADC_DATn (n: 0 ~ 18) register, user can enable this bit to generate a PDMA data transfer request.
 * |        |          |0 = PDMA data transfer Disabled.
 * |        |          |1 = PDMA data transfer Enabled.
 * |        |          |Note: When set this bit field to 1, user must set ADCIENn (EADC_CTL[5:2], n=0~3) = 0 to disable interrupt.
 * |[18:16] |SMPTSEL   |ADC Internal Sampling Time Selection
 * |        |          |ADC internal sampling cycle = SMPTSEL + 1.
 * |        |          |000 = 1 ADC clock sampling time.
 * |        |          |001 = 2 ADC clock sampling time.
 * |        |          |010 = 3 ADC clock sampling time.
 * |        |          |011 = 4 ADC clock sampling time.
 * |        |          |100 = 5 ADC clock sampling time.
 * |        |          |101 = 6 ADC clock sampling time.
 * |        |          |110 = 7 ADC clock sampling time.
 * |        |          |111 = 8 ADC clock sampling time.
 * @var EADC_T::SWTRG
 * Offset: 0x54  A/D Sample Module Software Start Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[18:0]  |SWTRG     |A/D Sample Module
 * |        |          |0~18 Software Force To Start ADC Conversion
 * |        |          |0 = No effect.
 * |        |          |1 = Cause an ADC conversion when the priority is given to sample module.
 * |        |          |Note: After write this register to start ADC conversion, the EADC_PENDSTS register will show which sample module will conversion.
 * |        |          |If user want to disable the conversion of the sample module, user can write EADC_PENDSTS register to clear it.
 * @var EADC_T::PENDSTS
 * Offset: 0x58  A/D Start of Conversion Pending Flag Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[18:0]  |STPF      |A/D Sample Module 0~18 Start Of Conversion Pending Flag
 * |        |          |Read:
 * |        |          |0 = There is no pending conversion for sample module.
 * |        |          |1 = Sample module ADC start of conversion is pending.
 * |        |          |Write:
 * |        |          |1 = clear pending flag and cancel the conversion for sample module.
 * |        |          |Note: This bit remains 1 during pending state, when the respective ADC conversion is end, the STPFn (n=0~18) bit is automatically cleared to 0
 * @var EADC_T::OVSTS
 * Offset: 0x5C  A/D Sample Module Start of Conversion Overrun Flag Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[18:0]  |SPOVF     |A/D SAMPLE0~18 Overrun Flag
 * |        |          |0 = No sample module event overrun.
 * |        |          |1 = Indicates a new sample module event is generated while an old one event is pending.
 * |        |          |Note: This bit is cleared by writing 1 to it.
 * @var EADC_T::SCTL
 * Offset: 0x80-0x8C  A/D Sample Module n Control Register, n=0~3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |CHSEL     |A/D Sample Module Channel Selection
 * |        |          |00H = EADC_CH0.
 * |        |          |01H = EADC_CH1.
 * |        |          |02H = EADC_CH2.
 * |        |          |03H = EADC_CH3.
 * |        |          |04H = EADC_CH4.
 * |        |          |05H = EADC_CH5.
 * |        |          |06H = EADC_CH6.
 * |        |          |07H = EADC_CH7.
 * |        |          |08H = EADC_CH8.
 * |        |          |09H = EADC_CH9.
 * |        |          |0AH = EADC_CH10.
 * |        |          |0BH = EADC_CH11.
 * |        |          |0CH = EADC_CH12.
 * |        |          |0DH = EADC_CH13.
 * |        |          |0EH = EADC_CH14.
 * |        |          |0FH = EADC_CH15.
 * |[4]     |EXTREN    |A/D External Trigger Rising Edge Enable Bit
 * |        |          |0 = Rising edge Disabled when A/D selects STADC as trigger source.
 * |        |          |1 = Rising edge Enabled when A/D selects STADC as trigger source.
 * |[5]     |EXTFEN    |A/D External Trigger Falling Edge Enable Bit
 * |        |          |0 = Falling edge Disabled when A/D selects STADC as trigger source.
 * |        |          |1 = Falling edge Enabled when A/D selects STADC as trigger source.
 * |[7:6]   |TRGDLYDIV |A/D Sample Module Start Of Conversion Trigger Delay Clock Divider Selection
 * |        |          |Trigger delay clock frequency:
 * |        |          |00 = ADC_CLK/1.
 * |        |          |01 = ADC_CLK/2.
 * |        |          |10 = ADC_CLK/4.
 * |        |          |11 = ADC_CLK/16.
 * |[15:8]  |TRGDLYCNT |A/D Sample Module Start Of Conversion Trigger Delay Time
 * |        |          |Trigger delay time = TRGDLYCNT x ADC_CLK x n (n=1,2,4,16 from TRGDLYDIV setting).
 * |[20:16] |TRGSEL    |A/D Sample Module Start Of Conversion Trigger Source Selection
 * |        |          |0H = Disable trigger.
 * |        |          |1H = External trigger from STADC pin input.
 * |        |          |2H = ADC ADINT0 interrupt EOC (End of conversion) pulse trigger.
 * |        |          |3H = ADC ADINT1 interrupt EOC (End of conversion) pulse trigger.
 * |        |          |4H = Timer0 overflow pulse trigger.
 * |        |          |5H = Timer1 overflow pulse trigger.
 * |        |          |6H = Timer2 overflow pulse trigger.
 * |        |          |7H = Timer3 overflow pulse trigger.
 * |        |          |8H = PWM0TG0.
 * |        |          |9H = PWM0TG1.
 * |        |          |AH = PWM0TG2.
 * |        |          |BH = PWM0TG3.
 * |        |          |CH = PWM0TG4.
 * |        |          |DH = PWM0TG5.
 * |        |          |EH = PWM1TG0.
 * |        |          |FH = PWM1TG1.
 * |        |          |10H = PWM1TG2.
 * |        |          |11H = PWM1TG3.
 * |        |          |12H = PWM1TG4.
 * |        |          |13H = PWM1TG5.
 * |        |          |other = Reserved.
 * |[22]    |INTPOS    |Interrupt Flag Position Select
 * |        |          |0 = Set ADIFn (EADC_STATUS2[n], n=0~3) at A/D end of conversion.
 * |        |          |1 = Set ADIFn (EADC_STATUS2[n], n=0~3) at A/D start of conversion.
 * |[23]    |DBMEN     |Double Buffer Mode Enable Bit
 * |        |          |0 = Sample has one sample result register. (default).
 * |        |          |1 = Sample has two sample result registers.
 * |[31:24] |EXTSMPT   |ADC Sampling Time Extend
 * |        |          |When A/D converting at high conversion rate, the sampling time of analog input voltage may not enough if input channel loading is heavy, user can extend A/D sampling time after trigger source is coming to get enough sampling time.
 * |        |          |The range of start delay time is from 0~255 ADC clock.
 * @var EADC_T::SCTL
 * Offset: 0x90-0xBC  A/D Sample Module n Control Register, n=4~15
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |CHSEL     |A/D Sample Module Channel Selection
 * |        |          |00H = EADC_CH0.
 * |        |          |01H = EADC_CH1.
 * |        |          |02H = EADC_CH2.
 * |        |          |03H = EADC_CH3.
 * |        |          |04H = EADC_CH4.
 * |        |          |05H = EADC_CH5.
 * |        |          |06H = EADC_CH6.
 * |        |          |07H = EADC_CH7.
 * |        |          |08H = EADC_CH8.
 * |        |          |09H = EADC_CH9.
 * |        |          |0AH = EADC_CH10.
 * |        |          |0BH = EADC_CH11.
 * |        |          |0CH = EADC_CH12.
 * |        |          |0DH = EADC_CH13.
 * |        |          |0EH = EADC_CH14.
 * |        |          |0FH = EADC_CH15.
 * |[4]     |EXTREN    |A/D External Trigger Rising Edge Enable Bit
 * |        |          |0 = Rising edge Disabled when A/D selects STADC as trigger source.
 * |        |          |1 = Rising edge Enabled when A/D selects STADC as trigger source.
 * |[5]     |EXTFEN    |A/D External Trigger Falling Edge Enable Bit
 * |        |          |0 = Falling edge Disabled when A/D selects STADC as trigger source.
 * |        |          |1 = Falling edge Enabled when A/D selects STADC as trigger source.
 * |[7:6]   |TRGDLYDIV[1:0]|A/D Sample Module Start Of Conversion Trigger Delay Clock Divider Selection
 * |        |          |Trigger delay clock frequency:
 * |        |          |00 = ADC_CLK/1.
 * |        |          |01 = ADC_CLK/2.
 * |        |          |10 = ADC_CLK/4.
 * |        |          |11 = ADC_CLK/16.
 * |[15:8]  |TRGDLYCNT[7:0]|A/D Sample Module Start Of Conversion Trigger Delay Time
 * |        |          |Trigger delay time = TRGDLYCNT x ADC_CLK x n (n=1,2,4,16 from TRGDLYDIV setting).
 * |[20:16] |TRGSEL    |A/D Sample Module Start Of Conversion Trigger Source Selection
 * |        |          |0H = Disable trigger.
 * |        |          |1H = External trigger from STADC pin input.
 * |        |          |2H = ADC ADINT0 interrupt EOC pulse trigger.
 * |        |          |3H = ADC ADINT1 interrupt EOC pulse trigger.
 * |        |          |4H = Timer0 overflow pulse trigger.
 * |        |          |5H = Timer1 overflow pulse trigger.
 * |        |          |6H = Timer2 overflow pulse trigger.
 * |        |          |7H = Timer3 overflow pulse trigger.
 * |        |          |8H = PWM0TG0.
 * |        |          |9H = PWM0TG1.
 * |        |          |AH = PWM0TG2.
 * |        |          |BH = PWM0TG3.
 * |        |          |CH = PWM0TG4.
 * |        |          |DH = PWM0TG5.
 * |        |          |EH = PWM1TG0.
 * |        |          |FH = PWM1TG1.
 * |        |          |10H = PWM1TG2.
 * |        |          |11H = PWM1TG3.
 * |        |          |12H = PWM1TG4.
 * |        |          |13H = PWM1TG5.
 * |        |          |other = Reserved.
 * |[22]    |INTPOS    |Interrupt Flag Position Select
 * |        |          |0 = Set ADIFn (EADC_STATUS2[n], n=0~3) at A/D end of conversion.
 * |        |          |1 = Set ADIFn (EADC_STATUS2[n], n=0~3) at A/D start of conversion.
 * |[31:24] |EXTSMPT   |ADC Sampling Time Extend
 * |        |          |When A/D converting at high conversion rate, the sampling time of analog input voltage may not enough if input channel loading is heavy, SW can extend A/D sampling time after trigger source is coming to get enough sampling time.
 * |        |          |The range of start delay time is from 0~255 ADC clock.
 * @var EADC_T::SCTL
 * Offset: 0xC0~0xC8  A/D Sample Module n Control Register, n=16~18
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:24] |EXTSMPT   |ADC Sampling Time Extend
 * |        |          |When A/D converting at high conversion rate, the sampling time of analog input voltage may not enough if input channel loading is heavy, SW can extend A/D sampling time after trigger source is coming to get enough sampling time.
 * |        |          |The range of start delay time is from 0~255 ADC clock.
 * @var EADC_T::INTSRC
 * Offset: 0xDC  ADC interrupt n Source Enable Control Register, n=0~3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SPLIE0    |Sample Module 0 Interrupt Enable Bit
 * |        |          |0 = Sample Module 0 interrupt Disabled.
 * |        |          |1 = Sample Module 0 interrupt Enabled.
 * |[1]     |SPLIE1    |Sample Module 1 Interrupt Enable Bit
 * |        |          |0 = Sample Module 1 interrupt Disabled.
 * |        |          |1 = Sample Module 1 interrupt Enabled.
 * |[2]     |SPLIE2    |Sample Module 2 Interrupt Enable Bit
 * |        |          |0 = Sample Module 2 interrupt Disabled.
 * |        |          |1 = Sample Module 2 interrupt Enabled.
 * |[3]     |SPLIE3    |Sample Module 3 Interrupt Enable Bit
 * |        |          |0 = Sample Module 3 interrupt Disabled.
 * |        |          |1 = Sample Module 3 interrupt Enabled.
 * |[4]     |SPLIE4    |Sample Module 4 Interrupt Enable Bit
 * |        |          |0 = Sample Module 4 interrupt Disabled.
 * |        |          |1 = Sample Module 4 interrupt Enabled.
 * |[5]     |SPLIE5    |Sample Module 5 Interrupt Enable Bit
 * |        |          |0 = Sample Module 5 interrupt Disabled.
 * |        |          |1 = Sample Module 5 interrupt Enabled.
 * |[6]     |SPLIE6    |Sample Module 6 Interrupt Enable Bit
 * |        |          |0 = Sample Module 6 interrupt Disabled.
 * |        |          |1 = Sample Module 6 interrupt Enabled.
 * |[7]     |SPLIE7    |Sample Module 7 Interrupt Enable Bit
 * |        |          |0 = Sample Module 7 interrupt Disabled.
