MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M453LG6AE/mcu.h
 * |        |          |Note: In complementary mode, CMPUCTL1, 3, 5 use as another CMPUCTL for channel 0, 2, 4.
 * |[27:16] |CMPDCTLn  |PWM Compare Down Point Control
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |00 = Do nothing.
 * |        |          |01 = PWM compare down point output Low.
 * |        |          |10 = PWM compare down point output High.
 * |        |          |11 = PWM compare down point output Toggle.
 * |        |          |PWM can control output level when PWM counter down count to CMPDAT.
 * |        |          |Note: In complementary mode, CMPDCTL1, 3, 5 use as another CMPDCTL for channel 0, 2, 4.
 * @var PWM_T::MSKEN
 * Offset: 0xB8  PWM Mask Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[5:0]   |MSKENn    |PWM Mask Enable
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |The PWM output signal will be masked when this bit is enabled.
 * |        |          |The corresponding PWM channel n will output MSKDATn (PWM_MSK[5:0]) data.
 * |        |          |0 = PWM output signal is non-masked.
 * |        |          |1 = PWM output signal is masked and output MSKDATn data.
 * @var PWM_T::MSK
 * Offset: 0xBC  PWM Mask Data Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[5:0]   |MSKDATn   |PWM Mask Data Bit
 * |        |          |This data bit control the state of PWMn output pin, if corresponding mask function is enabled.
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |0 = Output logic low to PWMn.
 * |        |          |1 = Output logic high to PWMn.
 * @var PWM_T::BNF
 * Offset: 0xC0  PWM Brake Noise Filter Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |BRK0NFEN  |PWM Brake 0 Noise Filter Enable
 * |        |          |0 = Noise filter of PWM Brake 0 Disabled.
 * |        |          |1 = Noise filter of PWM Brake 0 Enabled.
 * |[3:1]   |BRK0NFSEL |Brake 0 Edge Detector Filter Clock Selection
 * |        |          |000 = Filter clock = HCLK.
 * |        |          |001 = Filter clock = HCLK/2.
 * |        |          |010 = Filter clock = HCLK/4.
 * |        |          |011 = Filter clock = HCLK/8.
 * |        |          |100 = Filter clock = HCLK/16.
 * |        |          |101 = Filter clock = HCLK/32.
 * |        |          |110 = Filter clock = HCLK/64.
 * |        |          |111 = Filter clock = HCLK/128.
 * |[6:4]   |BRK0FCNT  |Brake 0 Edge Detector Filter Count
 * |        |          |The register bits control the Brake0 filter counter to count from 0 to BRK1FCNT.
 * |[7]     |BRK0PINV  |Brake 0 Pin Inverse
 * |        |          |0 = The state of pin PWMx_BRAKE0 is passed to the negative edge detector.
 * |        |          |1 = The inverted state of pin PWMx_BRAKE10 is passed to the negative edge detector.
 * |[8]     |BRK1NFEN  |PWM Brake 1 Noise Filter Enable
 * |        |          |0 = Noise filter of PWM Brake 1 Disabled.
 * |        |          |1 = Noise filter of PWM Brake 1 Enabled.
 * |[11:9]  |BRK1NFSEL |Brake 1 Edge Detector Filter Clock Selection
 * |        |          |000 = Filter clock = HCLK.
 * |        |          |001 = Filter clock = HCLK/2.
 * |        |          |010 = Filter clock = HCLK/4.
 * |        |          |011 = Filter clock = HCLK/8.
 * |        |          |100 = Filter clock = HCLK/16.
 * |        |          |101 = Filter clock = HCLK/32.
 * |        |          |110 = Filter clock = HCLK/64.
 * |        |          |111 = Filter clock = HCLK/128.
 * |[14:12] |BRK1FCNT  |Brake 1 Edge Detector Filter Count
 * |        |          |The register bits control the Brake1 filter counter to count from 0 to BRK1FCNT.
 * |[15]    |BRK1PINV  |Brake 1 Pin Inverse
 * |        |          |0 = The state of pin PWMx_BRAKE1 is passed to the negative edge detector.
 * |        |          |1 = The inverted state of pin PWMx_BRAKE1 is passed to the negative edge detector.
 * |[16]    |BK0SRC    |Brake 0 Pin Source Select (M45xD/M45xC Only)
 * |        |          |For PWM0 setting:
 * |        |          |0 = Brake 0 pin source come from PWM0_BRAKE0.
 * |        |          |1 = Brake 0 pin source come from PWM1_BRAKE0.
 * |        |          |For PWM1 setting:
 * |        |          |0 = Brake 0 pin source come from PWM1_BRAKE0.
 * |        |          |1 = Brake 0 pin source come from PWM0_BRAKE0.
 * |[24]    |BK1SRC    |Brake 1 Pin Source Select (M45xD/M45xC Only)
 * |        |          |For PWM0 setting:
 * |        |          |0 = Brake 1 pin source come from PWM0_BRAKE1.
 * |        |          |1 = Brake 1 pin source come from PWM1_BRAKE1.
 * |        |          |For PWM1 setting:
 * |        |          |0 = Brake 1 pin source come from PWM1_BRAKE1.
 * |        |          |1 = Brake 1 pin source come from PWM0_BRAKE1.
 * @var PWM_T::FAILBRK
 * Offset: 0xC4  PWM System Fail Brake Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CSSBRKEN  |Clock Security System Detection Trigger PWM Brake Function 0 Enable
 * |        |          |0 = Brake Function triggered by CSS detection Disabled.
 * |        |          |1 = Brake Function triggered by CSS detection Enabled.
 * |[1]     |BODBRKEN  |Brown-Out Detection Trigger PWM Brake Function 0 Enable
 * |        |          |0 = Brake Function triggered by BOD Disabled.
 * |        |          |1 = Brake Function triggered by BOD Enabled.
 * |[2]     |RAMBRKEN  |SRAM Parity Error Detection Trigger PWM Brake Function 0 Enable
 * |        |          |0 = Brake Function triggered by SRAM parity error detection Disabled.
 * |        |          |1 = Brake Function triggered by SRAM parity error detection Enabled.
 * |[3]     |CORBRKEN  |Core Lockup Detection Trigger PWM Brake Function 0 Enable
 * |        |          |0 = Brake Function triggered by Core lockup detection Disabled.
 * |        |          |1 = Brake Function triggered by Core lockup detection Enabled.
 * @var PWM_T::BRKCTL0_1
 * Offset: 0xC8  PWM Brake Edge Detect Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CPO0EBEN  |Enable ACMP0_O Digital Output As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = ACMP0_O as edge-detect brake source Disabled.
 * |        |          |1 = ACMP0_O as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[1]     |CPO1EBEN  |Enable ACMP1_O Digital Output As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = ACMP1_O as edge-detect brake source Disabled.
 * |        |          |1 = ACMP1_O as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[4]     |BRKP0EEN  |Enable PWMx_BRAKE0 Pin As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = BKP0 pin as edge-detect brake source Disabled.
 * |        |          |1 = BKP0 pin as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[5]     |BRKP1EEN  |Enable PWMx_BRAKE1 Pin As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = BKP1 pin as edge-detect brake source Disabled.
 * |        |          |1 = BKP1 pin as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[7]     |SYSEBEN   |Enable System Fail As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = System Fail condition as edge-detect brake source Disabled.
 * |        |          |1 = System Fail condition as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[8]     |CPO0LBEN  |Enable ACMP0_O Digital Output As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = ACMP0_O as level-detect brake source Disabled.
 * |        |          |1 = ACMP0_O as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[9]     |CPO1LBEN  |Enable ACMP1_O Digital Output As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = ACMP1_O as level-detect brake source Disabled.
 * |        |          |1 = ACMP1_O as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[12]    |BRKP0LEN  |Enable BKP0 Pin As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = PWMx_BRAKE0 pin as level-detect brake source Disabled.
 * |        |          |1 = PWMx_BRAKE0 pin as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[13]    |BRKP1LEN  |Enable BKP1 Pin As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = PWMx_BRAKE1 pin as level-detect brake source Disabled.
 * |        |          |1 = PWMx_BRAKE1 pin as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[15]    |SYSLBEN   |Enable System Fail As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = System Fail condition as level-detect brake source Disabled.
 * |        |          |1 = System Fail condition as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[17:16] |BRKAEVEN  |PWM Brake Action Select For Even Channel (Write Protect)
 * |        |          |00 = PWM even channel level-detect brake function not affect channel output.
 * |        |          |01 = PWM even channel output tri-state when level-detect brake happened.
 * |        |          |10 = PWM even channel output low level when level-detect brake happened.
 * |        |          |11 = PWM even channel output high level when level-detect brake happened.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[19:18] |BRKAODD   |PWM Brake Action Select For Odd Channel (Write Protect)
 * |        |          |00 = PWM odd channel level-detect brake function not affect channel output.
 * |        |          |01 = PWM odd channel output tri-state when level-detect brake happened.
 * |        |          |10 = PWM odd channel output low level when level-detect brake happened.
 * |        |          |11 = PWM odd channel output high level when level-detect brake happened.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * @var PWM_T::BRKCTL2_3
 * Offset: 0xCC  PWM Brake Edge Detect Control Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CPO0EBEN  |Enable ACMP0_O Digital Output As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = ACMP0_O as edge-detect brake source Disabled.
 * |        |          |1 = ACMP0_O as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[1]     |CPO1EBEN  |Enable ACMP1_O Digital Output As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = ACMP1_O as edge-detect brake source Disabled.
 * |        |          |1 = ACMP1_O as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[4]     |BRKP0EEN  |Enable PWMx_BRAKE0 Pin As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = BKP0 pin as edge-detect brake source Disabled.
 * |        |          |1 = BKP0 pin as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[5]     |BRKP1EEN  |Enable PWMx_BRAKE1 Pin As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = BKP1 pin as edge-detect brake source Disabled.
 * |        |          |1 = BKP1 pin as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[7]     |SYSEBEN   |Enable System Fail As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = System Fail condition as edge-detect brake source Disabled.
 * |        |          |1 = System Fail condition as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[8]     |CPO0LBEN  |Enable ACMP0_O Digital Output As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = ACMP0_O as level-detect brake source Disabled.
 * |        |          |1 = ACMP0_O as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[9]     |CPO1LBEN  |Enable ACMP1_O Digital Output As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = ACMP1_O as level-detect brake source Disabled.
 * |        |          |1 = ACMP1_O as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[12]    |BRKP0LEN  |Enable BKP0 Pin As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = PWMx_BRAKE0 pin as level-detect brake source Disabled.
 * |        |          |1 = PWMx_BRAKE0 pin as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[13]    |BRKP1LEN  |Enable BKP1 Pin As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = PWMx_BRAKE1 pin as level-detect brake source Disabled.
 * |        |          |1 = PWMx_BRAKE1 pin as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[15]    |SYSLBEN   |Enable System Fail As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = System Fail condition as level-detect brake source Disabled.
 * |        |          |1 = System Fail condition as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[17:16] |BRKAEVEN  |PWM Brake Action Select For Even Channel (Write Protect)
 * |        |          |00 = PWM even channel level-detect brake function not affect channel output.
 * |        |          |01 = PWM even channel output tri-state when level-detect brake happened.
 * |        |          |10 = PWM even channel output low level when level-detect brake happened.
 * |        |          |11 = PWM even channel output high level when level-detect brake happened.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[19:18] |BRKAODD   |PWM Brake Action Select For Odd Channel (Write Protect)
 * |        |          |00 = PWM odd channel level-detect brake function not affect channel output.
 * |        |          |01 = PWM odd channel output tri-state when level-detect brake happened.
 * |        |          |10 = PWM odd channel output low level when level-detect brake happened.
 * |        |          |11 = PWM odd channel output high level when level-detect brake happened.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * @var PWM_T::BRKCTL4_5
 * Offset: 0xD0  PWM Brake Edge Detect Control Register 4
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CPO0EBEN  |Enable ACMP0_O Digital Output As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = ACMP0_O as edge-detect brake source Disabled.
 * |        |          |1 = ACMP0_O as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[1]     |CPO1EBEN  |Enable ACMP1_O Digital Output As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = ACMP1_O as edge-detect brake source Disabled.
 * |        |          |1 = ACMP1_O as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[4]     |BRKP0EEN  |Enable PWMx_BRAKE0 Pin As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = BKP0 pin as edge-detect brake source Disabled.
 * |        |          |1 = BKP0 pin as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[5]     |BRKP1EEN  |Enable PWMx_BRAKE1 Pin As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = BKP1 pin as edge-detect brake source Disabled.
 * |        |          |1 = BKP1 pin as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[7]     |SYSEBEN   |Enable System Fail As Edge-Detect Brake Source (Write Protect)
 * |        |          |0 = System Fail condition as edge-detect brake source Disabled.
 * |        |          |1 = System Fail condition as edge-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[8]     |CPO0LBEN  |Enable ACMP0_O Digital Output As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = ACMP0_O as level-detect brake source Disabled.
 * |        |          |1 = ACMP0_O as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[9]     |CPO1LBEN  |Enable ACMP1_O Digital Output As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = ACMP1_O as level-detect brake source Disabled.
 * |        |          |1 = ACMP1_O as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[12]    |BRKP0LEN  |Enable BKP0 Pin As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = PWMx_BRAKE0 pin as level-detect brake source Disabled.
 * |        |          |1 = PWMx_BRAKE0 pin as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[13]    |BRKP1LEN  |Enable BKP1 Pin As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = PWMx_BRAKE1 pin as level-detect brake source Disabled.
 * |        |          |1 = PWMx_BRAKE1 pin as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[15]    |SYSLBEN   |Enable System Fail As Level-Detect Brake Source (Write Protect)
 * |        |          |0 = System Fail condition as level-detect brake source Disabled.
 * |        |          |1 = System Fail condition as level-detect brake source Enabled.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[17:16] |BRKAEVEN  |PWM Brake Action Select For Even Channel (Write Protect)
 * |        |          |00 = PWM even channel level-detect brake function not affect channel output.
 * |        |          |01 = PWM even channel output tri-state when level-detect brake happened.
 * |        |          |10 = PWM even channel output low level when level-detect brake happened.
 * |        |          |11 = PWM even channel output high level when level-detect brake happened.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[19:18] |BRKAODD   |PWM Brake Action Select For Odd Channel (Write Protect)
 * |        |          |00 = PWM odd channel level-detect brake function not affect channel output.
 * |        |          |01 = PWM odd channel output tri-state when level-detect brake happened.
 * |        |          |10 = PWM odd channel output low level when level-detect brake happened.
 * |        |          |11 = PWM odd channel output high level when level-detect brake happened.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * @var PWM_T::POLCTL
 * Offset: 0xD4  PWM Pin Polar Inverse Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[5:0]   |PINVn     |PWM PIN Polar Inverse Control
 * |        |          |The register controls polarity state of PWM output.
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |0 = PWM output polar inverse Disabled.
 * |        |          |1 = PWM output polar inverse Enabled.
 * @var PWM_T::POEN
 * Offset: 0xD8  PWM Output Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[5:0]   |POENn     |PWM Pin Output Enable
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |0 = PWM pin at tri-state.
 * |        |          |1 = PWM pin in output mode.
 * @var PWM_T::SWBRK
 * Offset: 0xDC  PWM Software Brake Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |BRKETRGn  |PWM Edge Brake Software Trigger (Write Only) (Write Protect) (M45xD/M45xC Only)
 * |        |          |Each bit n controls the corresponding PWM pair n.
 * |        |          |Write 1 to this bit will trigger edge brake, and set BRKEIFn to 1 in PWM_INTSTS1 register.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * |[10:8]  |BRKLTRGn  |PWM Level Brake Software Trigger (Write Only) (Write Protect)
 * |        |          |Each bit n controls the corresponding PWM pair n.
 * |        |          |Write 1 to this bit will trigger level brake, and set BRKLIFn to 1 in PWM_INTSTS1 register.
 * |        |          |Note: This register is write protected. Refer to SYS_REGLCTL register.
 * @var PWM_T::INTEN0
 * Offset: 0xE0  PWM Interrupt Enable Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[5:0]   |ZIENn     |PWM Zero Point Interrupt Enable
 * |        |          |Each bit n controls the corresponding PWM channel n.
 * |        |          |0 = Zero point interrupt Disabled.
 * |        |          |1 = Zero point interrupt Enabled.
 * |        |          |Note: Odd channels will read always 0 at complementary mode.
 * |[7]     |IFAIEN0_1 |PWM_CH0/1 Interrupt Flag Accumulator Interrupt Enable
 * |        |          |0 = Interrupt Flag accumulator interrupt Disabled.
 * |        |          |1 = Interrupt Flag accumulator interrupt Enabled.
 * |[13:8]  |PIENn     |PWM Period Point Interrupt Enable
 * |        |          |Each bit n controls the corresponding PWM channel n.
