MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M453LG6AE/mcu.h
#define PWM_FTCI_FTCMD2_Pos              (9)                                               /*!< PWM_T::FTCI: FTCMD2 Position              */
#define PWM_FTCI_FTCMD2_Msk              (0x1ul << PWM_FTCI_FTCMD2_Pos)                    /*!< PWM_T::FTCI: FTCMD2 Mask                  */

#define PWM_FTCI_FTCMD4_Pos              (10)                                              /*!< PWM_T::FTCI: FTCMD4 Position              */
#define PWM_FTCI_FTCMD4_Msk              (0x1ul << PWM_FTCI_FTCMD4_Pos)                    /*!< PWM_T::FTCI: FTCMD4 Mask                  */

/**@}*/ /* PWM_CONST */
/**@}*/ /* end of PWM register group */


/*---------------------- Real Time Clock Controller -------------------------*/
/**
    @addtogroup RTC Real Time Clock Controller(RTC)
    Memory Mapped Structure for RTC Controller
@{ */


typedef struct
{




/**
 * @var RTC_T::INIT
 * Offset: 0x00  RTC Initiation Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |INIT[0]/ACTIVE|RTC Active Status (Read Only)
 * |        |          |0 = RTC is at reset state.
 * |        |          |1 = RTC is at normal active state.
 * |[31:1]  |INIT[31:1]|RTC Initiation
 * |        |          |When RTC block is powered on, RTC is at reset state.
 * |        |          |User has to write a number (0x a5eb1357) to INIT to make RTC leaving reset state.
 * |        |          |Once the INIT is written as 0xa5eb1357, the RTC will be in un-reset state permanently.
 * |        |          |The INIT is a write-only field and read value will be always 0.
 * @var RTC_T::RWEN
 * Offset: 0x04  RTC Access Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |RWEN      |RTC Register Access Enable Password (Write Only)
 * |        |          |Writing 0xA965 to this register will enable RTC access and keep 1024 RTC clock.
 * |[16]    |RWENF     |RTC Register Access Enable Flag (Read Only)
 * |        |          |0 = RTC register read/write Disabled.
 * |        |          |1 = RTC register read/write Enabled.
 * |        |          |This bit will be set after RTC_RWEN[15:0] register is load a 0xA965, and be cleared automatically after 1024 RTC clock.
 * @var RTC_T::FREQADJ
 * Offset: 0x08  RTC Frequency Compensation Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[5:0]   |FRACTION  |Fraction Part
 * |        |          |Formula = (fraction part of detected value) x 60.
 * |        |          |Note: Digit in RTC_FREQADJ must be expressed as hexadecimal number.
 * |[11:8]  |INTEGER   |Integer Part
 * @var RTC_T::TIME
 * Offset: 0x0C  Time Loading Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |SEC       |1-Sec Time Digit (0~9)
 * |[6:4]   |TENSEC    |10-Sec Time Digit (0~5)
 * |[11:8]  |MIN       |1-Min Time Digit (0~9)
 * |[14:12] |TENMIN    |10-Min Time Digit (0~5)
 * |[19:16] |HR        |1-Hour Time Digit (0~9)
 * |[21:20] |TENHR     |10-Hour Time Digit (0~2)
 * @var RTC_T::CAL
 * Offset: 0x10  RTC Calendar Loading Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |DAY       |1-Day Calendar Digit (0~9)
 * |[5:4]   |TENDAY    |10-Day Calendar Digit (0~3)
 * |[11:8]  |MON       |1-Month Calendar Digit (0~9)
 * |[12]    |TENMON    |10-Month Calendar Digit (0~1)
 * |[19:16] |YEAR      |1-Year Calendar Digit (0~9)
 * |[23:20] |TENYEAR   |10-Year Calendar Digit (0~9)
 * @var RTC_T::CLKFMT
 * Offset: 0x14  Time Scale Selection Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |24HEN     |24-Hour / 12-Hour Time Scale Selection
 * |        |          |Indicates that RTC_TIME and RTC_TALM are in 24-hour time scale or 12-hour time scale
 * |        |          |0 = 12-hour time scale with AM and PM indication selected.
 * |        |          |1 = 24-hour time scale selected.
 * @var RTC_T::WEEKDAY
 * Offset: 0x18  Day of the Week Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |WEEKDAY   |Day Of The Week Register
 * |        |          |000 = Sunday.
 * |        |          |001 = Monday.
 * |        |          |010 = Tuesday.
 * |        |          |011 = Wednesday.
 * |        |          |100 = Thursday.
 * |        |          |101 = Friday.
 * |        |          |110 = Saturday.
 * |        |          |111 = Reserved.
 * @var RTC_T::TALM
 * Offset: 0x1C  Time Alarm Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |SEC       |1-Sec Time Digit of Alarm Setting (0~9)
 * |[6:4]   |TENSEC    |10-Sec Time Digit of Alarm Setting (0~5)
 * |[11:8]  |MIN       |1-Min Time Digit of Alarm Setting (0~9)
 * |[14:12] |TENMIN    |10-Min Time Digit of Alarm Setting (0~5)
 * |[19:16] |HR        |1-Hour Time Digit of Alarm Setting (0~9)
 * |[21:20] |TENHR     |10-Hour Time Digit of Alarm Setting (0~2)
 * @var RTC_T::CALM
 * Offset: 0x20  Calendar Alarm Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |DAY       |1-Day Calendar Digit of Alarm Setting (0~9)
 * |[5:4]   |TENDAY    |10-Day Calendar Digit of Alarm Setting (0~3)
 * |[11:8]  |MON       |1-Month Calendar Digit of Alarm Setting (0~9)
 * |[12]    |TENMON    |10-Month Calendar Digit of Alarm Setting (0~1)
 * |[19:16] |YEAR      |1-Year Calendar Digit of Alarm Setting (0~9)
 * |[23:20] |TENYEAR   |10-Year Calendar Digit of Alarm Setting (0~9)
 * @var RTC_T::LEAPYEAR
 * Offset: 0x24  RTC Leap Year Indicator Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |LEAPYEAR  |Leap Year Indication Register (Read Only)
 * |        |          |0 = This year is not a leap year.
 * |        |          |1 = This year is leap year.
 * @var RTC_T::INTEN
 * Offset: 0x28  RTC Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ALMIEN    |Alarm Interrupt Enable Bit
 * |        |          |0 = RTC Alarm interrupt Disabled.
 * |        |          |1 = RTC Alarm interrupt Enabled.
 * |[1]     |TICKIEN   |Time Tick Interrupt Enable Bit
 * |        |          |0 = RTC Time Tick interrupt Disabled.
 * |        |          |1 = RTC Time Tick interrupt Enabled.
 * |[2]     |SNPDIEN   |Snoop Detection Interrupt Enable Bit
 * |        |          |0 = Snoop detected interrupt Disabled.
 * |        |          |1 = Snoop detected interrupt Enabled.
 * @var RTC_T::INTSTS
 * Offset: 0x2C  RTC Interrupt Indicator Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ALMIF     |RTC Alarm Interrupt Flag
 * |        |          |When RTC time counters RTC_TIME and RTC_CAL match the alarm setting time registers RTC_TALM and RTC_CALM, this bit will be set to 1 and an interrupt will be generated if RTC Alarm Interrupt enabled ALMIEN (RTC_INTEN[0]) is set to 1.
 * |        |          |Chip will be waken up if RTC Alarm Interrupt is enabled when chip is at Power-down mode.
 * |        |          |0 = Alarm condition is not matched.
 * |        |          |1 = Alarm condition is matched.
 * |        |          |Note: Write 1 to clear this bit.
 * |[1]     |TICKIF    |RTC Time Tick Interrupt Flag
 * |        |          |When RTC time tick happened, this bit will be set to 1 and an interrupt will be generated if RTC Tick Interrupt enabled TICKIEN (RTC_INTEN[1]) is set to 1.
 * |        |          |Chip will also be waken up if RTC Tick Interrupt is enabled and this bit is set to 1 when chip is running at Power-down mode.
 * |        |          |0 = Tick condition does not occur.
 * |        |          |1 = Tick condition occur.
 * |        |          |Note: Write 1 to clear to clear this bit.
 * |[2]     |SNPDIF    |Snoop Detect Interrupt Flag
 * |        |          |When tamper pin transition event is detected, this bit is set to 1 and an interrupt is generated if Snoop Detection Interrupt enabled SNPDIEN (RTC_INTEN[2]) is set to1.
 * |        |          |Chip will be waken up from Power-down mode if spare register snooper detect interrupt is enabled.
 * |        |          |0 = No snoop event is detected.
 * |        |          |1 = Snoop event is detected.
 * |        |          |Note: Write 1 to clear this bit.
 * @var RTC_T::TICK
 * Offset: 0x30  RTC Time Tick Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |TICK      |Time Tick Register
 * |        |          |These bits are used to select RTC time tick period for Periodic Time Tick Interrupt request.
 * |        |          |000 = Time tick is 1 second.
 * |        |          |001 = Time tick is 1/2 second.
 * |        |          |010 = Time tick is 1/4 second.
 * |        |          |011 = Time tick is 1/8 second.
 * |        |          |100 = Time tick is 1/16 second.
 * |        |          |101 = Time tick is 1/32 second.
 * |        |          |110 = Time tick is 1/64 second.
 * |        |          |111 = Time tick is 1/28 second.
 * |        |          |Note: This register can be read back after the RTC register access enable bit RWENF (RTC_RWEN[16]) is active.
 * @var RTC_T::TAMSK
 * Offset: 0x34  Time Alarm Mask Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |MSEC      |Mask 1-Sec Time Digit of Alarm Setting (0~9)
 * |[1]     |MTENSEC   |Mask 10-Sec Time Digit of Alarm Setting (0~5)
 * |[2]     |MMIN      |Mask 1-Min Time Digit of Alarm Setting (0~9)
 * |[3]     |MTENMIN   |Mask 10-Min Time Digit of Alarm Setting (0~5)
 * |[4]     |MHR       |Mask 1-Hour Time Digit of Alarm Setting (0~9)
 * |[5]     |MTENHR    |Mask 10-Hour Time Digit of Alarm Setting (0~2)
 * @var RTC_T::CAMSK
 * Offset: 0x38  Calendar Alarm Mask Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |MDAY      |Mask 1-Day Calendar Digit of Alarm Setting (0~9)
 * |[1]     |MTENDAY   |Mask 10-Day Calendar Digit of Alarm Setting (0~3)
 * |[2]     |MMON      |Mask 1-Month Calendar Digit of Alarm Setting (0~9)
 * |[3]     |MTENMON   |Mask 10-Month Calendar Digit of Alarm Setting (0~1)
 * |[4]     |MYEAR     |Mask 1-Year Calendar Digit of Alarm Setting (0~9)
 * |[5]     |MTENYEAR  |Mask 10-Year Calendar Digit of Alarm Setting (0~9)
 * @var RTC_T::SPRCTL
 * Offset: 0x3C  RTC Spare Functional Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SNPDEN    |Snoop Detection Enable Bit
 * |        |          |0 = TAMPER pin detection is Disabled.
 * |        |          |1 = TAMPER pin detection is Enabled.
 * |[1]     |SNPTYPE0  |Snoop Detection Level
 * |        |          |This bit controls TAMPER detect event is high level/rising edge or low level/falling edge.
 * |        |          |0 = Low level/Falling edge detection.
 * |        |          |1 = High level/Rising edge detection.
 * |[2]     |SPRRWEN   |Spare Register Enable Bit
 * |        |          |0 = Spare register is Disabled.
 * |        |          |1 = Spare register is Enabled.
 * |        |          |Note: When spare register is disabled, RTC_SPR0 ~ RTC_SPR19 cannot be accessed.
 * |[3]     |SNPTYPE1  |Snoop Detection Mode
 * |        |          |This bit controls TAMPER pin is edge or level detection
 * |        |          |0 = Level detection.
 * |        |          |1 = Edge detection.
 * |[5]     |SPRCSTS   |SPR Clear Flag
 * |        |          |This bit indicates if the RTC_SPR0 ~RTC_SPR19 content is cleared when specify snoop event is detected.
 * |        |          |0 = Spare register content is not cleared.
 * |        |          |1 = Spare register content is cleared.
 * |        |          |Writes 1 to clear this bit.
 * |[7]     |SPRRWRDY  |SPR Register Ready
 * |        |          |This bit indicates if the registers RTC_SPRCTL, RTC_SPR0 ~ RTC_SPR19 are ready to be accessed.
 * |        |          |After user writing registers RTC_SPRCTL, RTC_SPR0 ~ RTC_SPR19, read this bit to check if these registers are up2025-06-05d done is necessary.
 * |        |          |0 = RTC_SPRCTL, RTC_SPR0 ~ RTC_SPR19 updating is in progress.
 * |        |          |1 = RTC_SPRCTL, RTC_SPR0 ~ RTC_SPR19 are up2025-06-05d done and ready to be accessed.
 * |        |          |Note: This bit is read only and any write to it won't take any effect.
 * @var RTC_T::SPR
 * Offset: 0x40 ~ 0x8C  RTC Spare Register 0 ~ 19
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |SPARE     |Spare Register
 * |        |          |This field is used to store back-up information defined by user.
 * |        |          |This field will be cleared by hardware automatically once a snooper pin event is detected.
 * |        |          |Before storing back-up information in to RTC_SPRx register, user should write 0xA965 to RTC_RWEN[15:0] to make sure register read/write enable bit REWNF (RTC_RWEN[16]) is enabled.
 * @var RTC_T::LXTCTL
 * Offset: 0x100  RTC 32.768 kHz Oscillator Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |LXTEN     |Backup Domain 32K Oscillator Enable Bit
 * |        |          |0 = Oscillator is Disabled.
 * |        |          |1 = Oscillator is Enabled.
 * |        |          |This bit controls 32 kHz oscillator on/off.
 * |        |          |User can set either LXTEN in RTC domain or system manager control register CLK_PWRCTL[1] (LXTEN) to enable 32 kHz oscillator.
 * |        |          |If this bit is set 1, X32 kHz oscillator keep running after system power is turned off, if this bit is clear to 0, oscillator is turned off when system power is turned off.
 * |[3:1]   |GAIN      |Oscillator Gain Option
 * |        |          |User can select oscillator gain according to crystal external loading and operating temperature range.
 * |        |          |The larger gain value corresponding to stronger driving capability and higher power consumption.
 * |        |          |000 = L0 mode.
 * |        |          |001 = L1 mode.
 * |        |          |010 = L2 mode.
 * |        |          |011 = L3 mode.
 * |        |          |100 = L4 mode.
 * |        |          |101 = L5 mode.
 * |        |          |110 = L6 mode.
 * |        |          |111 = L7 mode (Default).
 * @var RTC_T::LXTOCTL
 * Offset: 0x104  X32KO Pin Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |OPMODE    |GPF0 Operation Mode
 * |        |          |00 = X32KO (PF.0) is input only mode, without pull-up resistor.
 * |        |          |01 = X32KO (PF.0) is output push pull mode.
 * |        |          |10 = X32KO (PF.0) is open drain mode.
 * |        |          |11 = X32KO (PF.0) is input only mode with internal pull up.
 * |[2]     |DOUT      |IO Output Data
 * |        |          |0 = X32KO (PF.0) output low.
 * |        |          |1 = X32KO (PF.0) output high.
 * |[3]     |CTLSEL    |IO Pin State Backup Selection
 * |        |          |When low speed 32 kHz oscillator is disabled, X32KO (PF.0) pin can be used as GPIO function.
 * |        |          |User can program CTLSEL bit to decide X32KO (PF.0) I/O function is controlled by system power domain GPIO module or VBAT power domain RTC_LXTOCTL control register.
 * |        |          |0 = X32KO (PF.0) pin I/O function is controlled by GPIO module.
 * |        |          |It becomes floating when system power is turned off.
 * |        |          |1 = X32KO (PF.0) pin I/O function is controlled by VBAT power domain, X32KO (PF.0) pin function and I/O status are controlled by OPMODE[1:0] and DOUT after CTLSEL it set to 1.
 * |        |          |I/O pin keeps the previous state after system power is turned off.
 * @var RTC_T::LXTICTL
 * Offset: 0x108  X32KI Pin Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |OPMODE    |IO Operation Mode
 * |        |          |00 = X32KI (PF.1) is input only mode, without pull-up resistor.
 * |        |          |01 = X32KI (PF.1) is output push pull mode.
 * |        |          |10 = X32KI (PF.1) is open drain mode.
 * |        |          |11 = X32KI (PF.1) is input only mode with internal pull up.
 * |[2]     |DOUT      |IO Output Data
 * |        |          |0 = X32KI (PF.1) output low.
 * |        |          |1 = X32KI (PF.1) output high.
 * |[3]     |CTLSEL    |IO Pin State Backup Selection
 * |        |          |When low speed 32 kHz oscillator is disabled, X32KI (PF.1) pin can be used as GPIO function.
 * |        |          |User can program CTLSEL bit to decide X32KI (PF.1) I/O function is controlled by system power domain GPIO module or VBAT power domain RTC_LXTICTL control register.
 * |        |          |0 = X32KI (PF.1) pin I/O function is controlled by GPIO module.
 * |        |          |It becomes floating state when system power is turned off.
 * |        |          |1 = X32KI (PF.1) pin I/O function is controlled by VBAT power domain, X32KI (PF.1) pin function and I/O status are controlled by OPMODE[1:0] and DOUT after CTLSEL it set to 1.
 * |        |          |I/O pin keeps the previous state after system power is turned off.
 * @var RTC_T::TAMPCTL
 * Offset: 0x10C  TAMPER Pin Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |OPMODE    |IO Operation Mode
 * |        |          |00 = TAMPER (PF.2) is input only mode, without pull-up resistor.
 * |        |          |01 = TAMPER (PF.2) is output push pull mode.
 * |        |          |10 = TAMPER (PF.2) is open drain mode.
 * |        |          |11 = TAMPER (PF.2) is input only mode with internal pull up.
 * |[2]     |DOUT      |IO Output Data
 * |        |          |0 = TAMPER (PF.2) output low.
 * |        |          |1 = TAMPER (PF.2) output high.
 * |[3]     |CTLSEL    |IO Pin State Backup Selection
 * |        |          |When tamper function is disabled, TAMPER pin can be used as GPIO function.
 * |        |          |User can program CTLSEL bit to decide PF.2 I/O function is controlled by system power domain GPIO module or VBAT power domain RTC_TAMPCTL control register.
 * |        |          |0 =TAMPER (PF.2) I/O function is controlled by GPIO module.
 * |        |          |It becomes floating state when system power is turned off.
 * |        |          |1 =TAMPER (PF.2) I/O function is controlled by VBAT power domain.
 * |        |          |PF.2 function and I/O status are controlled by OPMODE[1:0] and DOUT after CTLSEL it set to 1.
 * |        |          |I/O pin state keeps previous state after system power is turned off.
 */

    __IO uint32_t INIT;          /* Offset: 0x00  RTC Initiation Register                                            */
    __O  uint32_t RWEN;          /* Offset: 0x04  RTC Access Enable Register                                         */
    __IO uint32_t FREQADJ;       /* Offset: 0x08  RTC Frequency Compensation Register                                */
    __IO uint32_t TIME;          /* Offset: 0x0C  Time Loading Register                                              */
    __IO uint32_t CAL;           /* Offset: 0x10  RTC Calendar Loading Register                                      */
    __IO uint32_t CLKFMT;        /* Offset: 0x14  Time Scale Selection Register                                      */
    __IO uint32_t WEEKDAY;       /* Offset: 0x18  Day of the Week Register                                           */
    __IO uint32_t TALM;          /* Offset: 0x1C  Time Alarm Register                                                */
    __IO uint32_t CALM;          /* Offset: 0x20  Calendar Alarm Register                                            */
    __I  uint32_t LEAPYEAR;      /* Offset: 0x24  RTC Leap Year Indicator Register                                   */
    __IO uint32_t INTEN;         /* Offset: 0x28  RTC Interrupt Enable Register                                      */
    __IO uint32_t INTSTS;        /* Offset: 0x2C  RTC Interrupt Indicator Register                                   */
    __IO uint32_t TICK;          /* Offset: 0x30  RTC Time Tick Register                                             */
    __IO uint32_t TAMSK;         /* Offset: 0x34  Time Alarm Mask Register                                           */
    __IO uint32_t CAMSK;         /* Offset: 0x38  Calendar Alarm Mask Register                                       */
    __IO uint32_t SPRCTL;        /* Offset: 0x3C  RTC Spare Functional Control Register                              */
    __IO uint32_t SPR[20];       /* Offset: 0x40 ~ 0x8C  RTC Spare Register 0 ~ 19                                   */
    __I  uint32_t RESERVE0[28]; 
    __IO uint32_t LXTCTL;        /* Offset: 0x100  RTC 32.768 kHz Oscillator Control Register                        */
    __IO uint32_t LXTOCTL;       /* Offset: 0x104  X32KO Pin Control Register                                        */
    __IO uint32_t LXTICTL;       /* Offset: 0x108  X32KI Pin Control Register                                        */
    __IO uint32_t TAMPCTL;       /* Offset: 0x10C  TAMPER Pin Control Register                                       */

} RTC_T;



/**
    @addtogroup RTC_CONST RTC Bit Field Definition
    Constant Definitions for RTC Controller
@{ */

