MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M453LG6AE/mcu.h
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:4]  |BCED      |Bulk Current Head ED
 * |        |          |Pointer to indicate the physical address of the current endpoint of the Bulk list.
 * @var USBH_T::HcDoneHead
 * Offset: 0x30  Host Controller Done Head Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:4]  |DH        |Done Head
 * |        |          |Pointer to indicate the physical address of the last completed Transfer Descriptor that was added to the Done queue.
 * @var USBH_T::HcFmInterval
 * Offset: 0x34  Host Controller Frame Interval Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[13:0]  |FI        |Frame Interval
 * |        |          |This field specifies the length of a frame as (bit times - 1).
 * |        |          |For 12,000 bit times in a frame, a value of 11,999 is stored here.
 * |[30:16] |FSMPS     |FS Largest Data Packet
 * |        |          |This field specifies a value that is loaded into the Largest Data Packet Counter at the beginning of each frame.
 * |[31]    |FIT       |Frame Interval Toggle
 * |        |          |This bit is toggled by Host Controller Driver when it loads a new value into FI (HcFmIntv[13:0]).
 * |        |          |0 = Host Controller Driver didn't load new value into FI (HcFmIntv[13:0]).
 * |        |          |1 = Host Controller Driver loads a new value into FI (HcFmIntv[13:0]).
 * @var USBH_T::HcFmRemaining
 * Offset: 0x38  Host Controller Frame Remaining Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[13:0]  |FR        |Frame Remaining
 * |        |          |When the Host Controller is in the USBOPERATIONAL state, this 14-bit field decrements each 12 MHz clock period.
 * |        |          |When the count reaches 0, (end of frame) the counter reloads with Frame Interval.
 * |        |          |In addition, the counter loads when the Host Controller transitions into USBOPERATIONAL.
 * |[31]    |FRT       |Frame Remaining Toggle
 * |        |          |This bit is loaded from the FIT (HcFmIntv[31]) whenever FR (HcFmRem[13:0]) reaches 0.
 * @var USBH_T::HcFmNumber
 * Offset: 0x3C  Host Controller Frame Number Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |FN        |Frame Number
 * |        |          |This 16-bit incrementing counter field is incremented coincident with the re-load of FR (HcFmRem[13:0]).
 * |        |          |The count rolls over from 'FFFFh' to '0h.'.
 * @var USBH_T::HcPeriodicStart
 * Offset: 0x40  Host Controller Periodic Start Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[13:0]  |PS        |Periodic Start
 * |        |          |This field contains a value used by the List Processor to determine where in a frame the Periodic List processing must begin.
 * @var USBH_T::HcLSThreshold
 * Offset: 0x44  Host Controller Low-speed Threshold Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |LST       |Low-Speed Threshold
 * |        |          |This field contains a value which is compared to the FR (HcFmRem[13:0]) field prior to initiating a Low-speed transaction.
 * |        |          |The transaction is started only if FR (HcFmRem[13:0]) >= this field.
 * |        |          |The value is calculated by Host Controller Driver with the consideration of transmission and setup overhead.
 * @var USBH_T::HcRhDescriptorA
 * Offset: 0x48  Host Controller Root Hub Descriptor A Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |NDP       |Number Downstream Ports
 * |        |          |USB host control supports two downstream ports and only one port is available in this series of chip.
 * |[8]     |PSM       |Power Switching Mode
 * |        |          |This bit is used to specify how the power switching of the Root Hub ports is controlled.
 * |        |          |0 = Global Switching.
 * |        |          |1 = Individual Switching.
 * |[11]    |OCPM      |Over Current Protection Mode
 * |        |          |This bit describes how the over current status for the Root Hub ports reported.
 * |        |          |This bit is only valid when NOCP (HcRhDeA[12]) is cleared.
 * |        |          |0 = Global Over current.
 * |        |          |1 = Individual Over current.
 * |[12]    |NOCP      |No Over Current Protection
 * |        |          |This bit describes how the over current status for the Root Hub ports reported.
 * |        |          |0 = Over current status is reported.
 * |        |          |1 = Over current status is not reported.
 * @var USBH_T::HcRhDescriptorB
 * Offset: 0x4C  Host Controller Root Hub Descriptor B Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:16] |PPCM      |Port Power Control Mask
 * |        |          |Global power switching.
 * |        |          |This field is only valid if PowerSwitchingMode is set (individual port switching).
 * |        |          |When set, the port only responds to individual port power switching commands (Set/ClearPortPower).
 * |        |          |When cleared, the port only responds to global power switching commands (Set/ClearGlobalPower).
 * |        |          |0 = Port power controlled by global power switching.
 * |        |          |1 = Port power controlled by port power switching.
 * |        |          |Note: PPCM[15:2] and PPCM[0] are reserved.
 * @var USBH_T::HcRhStatus
 * Offset: 0x50  Host Controller Root Hub Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |LPS       |Clear Global Power
 * |        |          |In global power mode (PSM (HcRhDeA[8]) = 0), this bit is written to one to clear all ports' power.
 * |        |          |This bit always read as zero.
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Clear global power.
 * |[1]     |OCI       |Over Current Indicator
 * |        |          |This bit reflects the state of the over current status pin.
 * |        |          |This field is only valid if NOCP (HcRhDesA[12]) and OCPM (HcRhDesA[11]) are cleared.
 * |        |          |0 = No over current condition.
 * |        |          |1 = Over current condition.
 * |[15]    |DRWE      |Device Remote Wakeup Enable Bit
 * |        |          |This bit controls if port's Connect Status Change as a remote wake-up event.
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Enable Connect Status Change as a remote wake-up event.
 * |        |          |Read Operation:
 * |        |          |0 = Connect Status Change as a remote wake-up event disabled.
 * |        |          |1 = Connect Status Change as a remote wake-up event enabled.
 * |[16]    |LPSC      |Set Global Power
 * |        |          |In global power mode (PSM (HcRhDeA[8]) = 0), this bit is written to one to enable power to all ports.
 * |        |          |This bit always read as zero.
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Set global power.
 * |[17]    |OCIC      |Over Current Indicator Change
 * |        |          |This bit is set by hardware when a change has occurred in OCI (HcRhSts[1]).
 * |        |          |Write 1 to clear this bit to zero.
 * |        |          |0 = OCI (HcRhSts[1]) didn't change.
 * |        |          |1 = OCI (HcRhSts[1]) change.
 * |[31]    |CRWE      |Clear Remote Wake-up Enable Bit
 * |        |          |This bit is use to clear DRWE (HcRhSts[15]).
 * |        |          |This bit always read as zero.
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Clear DRWE (HcRhSts[15]).
 * @var USBH_T::HcRhPortStatus
 * Offset: 0x54  Host Controller Root Hub Port Status [1]
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CCS       |CurrentConnectStatus (Read) Or ClearPortEnable Bit (Write)
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Clear port enable.
 * |        |          |Read Operation:
 * |        |          |0 = No device connected.
 * |        |          |1 = Device connected.
 * |[1]     |PES       |Port Enable Status
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Set port enable.
 * |        |          |Read Operation:
 * |        |          |0 = Port Disabled.
 * |        |          |1 = Port Enabled.
 * |[2]     |PSS       |Port Suspend Status
 * |        |          |This bit indicates the port is suspended
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Set port suspend.
 * |        |          |Read Operation:
 * |        |          |0 = Port is not suspended.
 * |        |          |1 = Port is selectively suspended.
 * |[3]     |POCI      |Port Over Current Indicator (Read) Or Clear Port Suspend (Write)
 * |        |          |This bit reflects the state of the over current status pin dedicated to this port.
 * |        |          |This field is only valid if NOCP (HcRhDeA[12]) is cleared and OCPM (HcRhDeA[11]) is set.
 * |        |          |This bit is also used to initiate the selective result sequence for the port.
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Clear port suspend.
 * |        |          |Read Operation:
 * |        |          |0 = No over current condition.
 * |        |          |1 = Over current condition.
 * |[4]     |PRS       |Port Reset Status
 * |        |          |This bit reflects the reset state of the port.
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Set port reset.
 * |        |          |Read Operation
 * |        |          |0 = Port reset signal is not active.
 * |        |          |1 = Port reset signal is active.
 * |[8]     |PPS       |Port Power Status
 * |        |          |This bit reflects the power state of the port regardless of the power switching mode.
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Port Power Enabled.
 * |        |          |Read Operation:
 * |        |          |0 = Port power is Disabled.
 * |        |          |1 = Port power is Enabled.
 * |[9]     |LSDA      |Low Speed Device Attached (Read) Or Clear Port Power (Write)
 * |        |          |This bit defines the speed (and bud idle) of the attached device.
 * |        |          |It is only valid when CCS (HcRhPrt1[0]) is set.
 * |        |          |This bit is also used to clear port power.
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Clear PPS (HcRhPrt1[8]).
 * |        |          |Read Operation:
 * |        |          |0 = Full Speed device.
 * |        |          |1 = Low-speed device.
 * |[16]    |CSC       |Connect Status Change
 * |        |          |This bit indicates connect or disconnect event has been detected (CCS
 * |        |          |(HcRhPrt1[0]) changed).
 * |        |          |Write 1 to clear this bit to zero.
 * |        |          |0 = No connect/disconnect event (CCS (HcRhPrt1[0]) didn't change).
 * |        |          |1 = Hardware detection of connect/disconnect event (CCS
 * |        |          |(HcRhPrt1[0]) changed).
 * |[17]    |PESC      |Port Enable Status Change
 * |        |          |This bit indicates that the port has been disabled (PES (HcRhPrt1[1]) cleared) due to a hardware event.
 * |        |          |Write 1 to clear this bit to zero.
 * |        |          |0 = PES (HcRhPrt1[1]) didn't change.
 * |        |          |1 = PES (HcRhPrt1[1]) changed.
 * |[18]    |PSSC      |Port Suspend Status Change
 * |        |          |This bit indicates the completion of the selective resume sequence for the port.
 * |        |          |Write 1 to clear this bit to zero.
 * |        |          |0 = Port resume is not completed.
 * |        |          |1 = Port resume completed.
 * |[19]    |OCIC      |Port Over Current Indicator Change
 * |        |          |This bit is set when POCI (HcRhPrt1[3]) changes.
 * |        |          |Write 1 to clear this bit to zero.
 * |        |          |0 = POCI (HcRhPrt1[3]) didn't change.
 * |        |          |1 = POCI (HcRhPrt1[3]) changes.
 * |[20]    |PRSC      |Port Reset Status Change
 * |        |          |This bit indicates that the port reset signal has completed.
 * |        |          |Write 1 to clear this bit to zero.
 * |        |          |0 = Port reset is not complete.
 * |        |          |1 = Port reset is complete.
 * @var USBH_T::HcPhyControl
 * Offset: 0x200  USB Host Controller PHY Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[27]    |STBYEN    |USB Transceiver Standby Enable Bit
 * |        |          |This bit controls if USB transceiver could enter the standby mode to reduce power consumption.
 * |        |          |0 = The USB transceiver would never enter the standby mode.
 * |        |          |1 = The USB transceiver will enter standby mode while port is in power off state (port power is inactive).
 * @var USBH_T::HcMiscControl
 * Offset: 0x204  USB Host Controller Miscellaneous Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1]     |ABORT     |AHB Bus ERROR Response
 * |        |          |This bit indicates there is an ERROR response received in AHB bus.
 * |        |          |0 = No ERROR response received.
 * |        |          |1 = ERROR response received.
 * |[3]     |OCAL      |Over Current Active Low
 * |        |          |This bit controls the polarity of over current flag from external power IC.
 * |        |          |0 = Over current flag is high active.
 * |        |          |1 = Over current flag is low active.
 * |[16]    |DPRT1     |Disable Port 1
 * |        |          |This bit controls if the connection between USB host controller and transceiver of port 1 is disabled.
 * |        |          |If the connection is disabled, the USB host controller will not recognize any event of USB bus.
 * |        |          |Set this bit high, the transceiver of port 1 will also be forced into the standby mode no matter what USB host controller operation is.
 * |        |          |0 = The connection between USB host controller and transceiver of port 1 is enabled.
 * |        |          |1 = The connection between USB host controller and transceiver of port 1 is disabled and the transceiver of port 1 will also be forced into the standby mode.
    */

    __I  uint32_t HcRevision;    /* Offset: 0x00  Host Controller Revision Register                                  */
    __IO uint32_t HcControl;     /* Offset: 0x04  Host Controller Control Register                                   */
    __IO uint32_t HcCommandStatus; /* Offset: 0x08  Host Controller CMD Status Register                                */
    __IO uint32_t HcInterruptStatus; /* Offset: 0x0C  Host Controller Interrupt Status Register                          */
    __IO uint32_t HcInterruptEnable; /* Offset: 0x10  Host Controller Interrupt Enable Register                          */
    __IO uint32_t HcInterruptDisable; /* Offset: 0x14  Host Controller Interrupt Disable Register                         */
    __IO uint32_t HcHCCA;        /* Offset: 0x18  Host Controller Communication Area Register                        */
    __IO uint32_t HcPeriodCurrentED; /* Offset: 0x1C  Host Controller Period Current ED Register                         */
    __IO uint32_t HcControlHeadED; /* Offset: 0x20  Host Controller Control Head ED Register                           */
    __IO uint32_t HcControlCurrentED; /* Offset: 0x24  Host Controller Control Current ED Register                        */
    __IO uint32_t HcBulkHeadED;  /* Offset: 0x28  Host Controller Bulk Head ED Register                              */
    __IO uint32_t HcBulkCurrentED; /* Offset: 0x2C  Host Controller Bulk Current ED Register                           */
    __IO uint32_t HcDoneHead;    /* Offset: 0x30  Host Controller Done Head Register                                 */
    __IO uint32_t HcFmInterval;  /* Offset: 0x34  Host Controller Frame Interval Register                            */
    __I  uint32_t HcFmRemaining; /* Offset: 0x38  Host Controller Frame Remaining Register                           */
    __I  uint32_t HcFmNumber;    /* Offset: 0x3C  Host Controller Frame Number Register                              */
    __IO uint32_t HcPeriodicStart; /* Offset: 0x40  Host Controller Periodic Start Register                            */
    __IO uint32_t HcLSThreshold; /* Offset: 0x44  Host Controller Low-speed Threshold Register                       */
    __IO uint32_t HcRhDescriptorA; /* Offset: 0x48  Host Controller Root Hub Descriptor A Register                     */
    __IO uint32_t HcRhDescriptorB; /* Offset: 0x4C  Host Controller Root Hub Descriptor B Register                     */
    __IO uint32_t HcRhStatus;    /* Offset: 0x50  Host Controller Root Hub Status Register                           */
    __IO uint32_t HcRhPortStatus[2]; /* Offset: 0x54  Host Controller Root Hub Port Status [1]                           */
    __I  uint32_t RESERVE0[105];
    __IO uint32_t HcPhyControl;  /* Offset: 0x200  USB Host Controller PHY Control Register                          */
    __IO uint32_t HcMiscControl; /* Offset: 0x204  USB Host Controller Miscellaneous Control Register                */

} USBH_T;




/**
    @addtogroup USBH_CONST USBH Bit Field Definition
    Constant Definitions for USBH Controller
@{ */

#define USBH_HcRevision_REV_Pos          (0)                                               /*!< USBH_T::HcRevision: REV Position          */
#define USBH_HcRevision_REV_Msk          (0xfful << USBH_HcRevision_REV_Pos)               /*!< USBH_T::HcRevision: REV Mask              */

#define USBH_HcControl_CBSR_Pos          (0)                                               /*!< USBH_T::HcControl: CBSR Position          */
#define USBH_HcControl_CBSR_Msk          (0x3ul << USBH_HcControl_CBSR_Pos)                /*!< USBH_T::HcControl: CBSR Mask              */

#define USBH_HcControl_PLE_Pos           (2)                                               /*!< USBH_T::HcControl: CBSR Position          */
#define USBH_HcControl_PLE_Msk           (0x1ul << USBH_HcControl_PLE_Pos)                 /*!< USBH_T::HcControl: CBSR Mask              */

#define USBH_HcControl_IE_Pos            (3)                                               /*!< USBH_T::HcControl: IE Position            */
#define USBH_HcControl_IE_Msk            (0x1ul << USBH_HcControl_IE_Pos)                  /*!< USBH_T::HcControl: IE Mask                */

#define USBH_HcControl_CLE_Pos           (4)                                               /*!< USBH_T::HcControl: CLE Position           */
#define USBH_HcControl_CLE_Msk           (0x1ul << USBH_HcControl_CLE_Pos)                 /*!< USBH_T::HcControl: CLE Mask               */

